=== doc

The `doc` commands are for managing the documents stored in the registered clusters.

==== `doc get`

Gets a doc from the active cluster, bucket, scope and collection:

```
👤 Charlie 🏠 local in 🗄 travel-sample._default._default
> doc get airline_10
╭───┬────────────┬──────────────────────────────┬─────────────────────┬───────┬─────────╮
│ # │     id     │           content            │         cas         │ error │ cluster │
├───┼────────────┼──────────────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ airline_10 │ ╭──────────┬───────────────╮ │ 1726047084573556736 │       │ local   │
│   │            │ │ id       │ 10            │ │                     │       │         │
│   │            │ │ type     │ airline       │ │                     │       │         │
│   │            │ │ name     │ 40-Mile Air   │ │                     │       │         │
│   │            │ │ iata     │ Q5            │ │                     │       │         │
│   │            │ │ icao     │ MLA           │ │                     │       │         │
│   │            │ │ callsign │ MILE-AIR      │ │                     │       │         │
│   │            │ │ country  │ United States │ │                     │       │         │
│   │            │ ╰──────────┴───────────────╯ │                     │       │         │
╰───┴────────────┴──────────────────────────────┴─────────────────────┴───────┴─────────╯
```

The contents of the document are returned in the `content` column alongside the document metadata (id, cas, error and cluster).

`doc get` can get multiple documents at once using an input stream:

```
👤 Charlie 🏠 local in 🗄 travel-sample._default._default
> [airline_10 airline_10748 airline_137] | wrap id | doc get
╭───┬───────────────┬──────────────────────────────┬─────────────────────┬───────┬──────────────╮
│ # │      id       │           content            │         cas         │ error │   cluster    │
├───┼───────────────┼──────────────────────────────┼─────────────────────┼───────┼──────────────┤
│ 0 │ airline_10    │ ╭──────────┬───────────────╮ │ 1712321628975398912 │       │ prod-us-west │
│   │               │ │ id       │ 10            │ │                     │       │              │
│   │               │ │ type     │ airline       │ │                     │       │              │
│   │               │ │ name     │ 40-Mile Air   │ │                     │       │              │
│   │               │ │ iata     │ Q5            │ │                     │       │              │
│   │               │ │ icao     │ MLA           │ │                     │       │              │
│   │               │ │ callsign │ MILE-AIR      │ │                     │       │              │
│   │               │ │ country  │ United States │ │                     │       │              │
│   │               │ ╰──────────┴───────────────╯ │                     │       │              │
│ 1 │ airline_137   │ ╭──────────┬────────────╮    │ 1712321633323712512 │       │ prod-us-west │
│   │               │ │ id       │ 137        │    │                     │       │              │
│   │               │ │ type     │ airline    │    │                     │       │              │
│   │               │ │ name     │ Air France │    │                     │       │              │
│   │               │ │ iata     │ AF         │    │                     │       │              │
│   │               │ │ icao     │ AFR        │    │                     │       │              │
│   │               │ │ callsign │ AIRFRANS   │    │                     │       │              │
│   │               │ │ country  │ France     │    │                     │       │              │
│   │               │ ╰──────────┴────────────╯    │                     │       │              │
│ 2 │ airline_10748 │ ╭──────────┬───────────────╮ │ 1712321631323947008 │       │ prod-us-west │
│   │               │ │ id       │ 10748         │ │                     │       │              │
│   │               │ │ type     │ airline       │ │                     │       │              │
│   │               │ │ name     │ Locair        │ │                     │       │              │
│   │               │ │ iata     │ ZQ            │ │                     │       │              │
│   │               │ │ icao     │ LOC           │ │                     │       │              │
│   │               │ │ callsign │ LOCAIR        │ │                     │       │              │
│   │               │ │ country  │ United States │ │                     │       │              │
│   │               │ ╰──────────┴───────────────╯ │                     │       │              │
╰───┴───────────────┴──────────────────────────────┴─────────────────────┴───────┴──────────────╯
```

`doc get` will extract the id from the `id` column, which is why you need to use https://www.nushell.sh/commands/docs/wrap.html[wrap].
But the `id` can be extracted from a different input column using the `--id-column` flag.

==== `doc import`

The simplest way to import data into the active cluster.
The data can be in any of the formats supported by the https://www.nushell.sh/commands/docs/from.html[from] command.

```
👤 Charlie 🏠 local in 🗄 default._default._default
> cat user.json
{
  "id": 123,
  "name": "Michael",
  "age": 32,
  "height": 180
}
👤 Charlie 🏠 local in 🗄 default._default._default
> doc import user.json
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ local   │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
👤 Charlie 🏠 local in 🗄 default._default._default
> doc get 123
╭───┬─────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │ id  │       content        │         cas         │ error │ cluster │
├───┼─────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ 123 │ ╭────────┬─────────╮ │ 1726063078042501120 │       │ local   │
│   │     │ │ id     │ 123     │ │                     │       │         │
│   │     │ │ name   │ Michael │ │                     │       │         │
│   │     │ │ age    │ 32      │ │                     │       │         │
│   │     │ │ height │ 180     │ │                     │       │         │
│   │     │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

`doc import` will use the `id` field in the source document as the document key by default, but this behaviour can be changed with the `--id-column` flag.

```
👤 Charlie 🏠 local in 🗄 default._default._default
> cat user.csv
name,age,height
Michael,32,180
👤 Charlie 🏠 local in 🗄 default._default._default
> doc import user.csv --id-column name
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ local   │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
👤 Charlie 🏠 local in 🗄 default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726063937243250688 │       │ local   │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 32      │ │                     │       │         │
│   │         │ │ height │ 180     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

TIP: look at the many different import formats `from` supports, including csv, xml, yaml and even sqlite.
With this simple tool at hand you are able to load many different data formats quickly and import them into Couchbase!

==== `doc insert`

Inserts document into the active bucket/scope/collection:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json
╭────────┬─────────╮
│ name   │ Michael │
│ age    │ 32      │
│ height │ 180     │
╰────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc insert
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
```

And if a document already exists in the active collection with this key then the command will fail:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc insert
╭───┬───────────┬─────────┬────────┬────────────────────┬─────────╮
│ # │ processed │ success │ failed │      failures      │ cluster │
├───┼───────────┼─────────┼────────┼────────────────────┼─────────┤
│ 0 │         1 │       0 │      1 │ Key already exists │ remote  │
╰───┴───────────┴─────────┴────────┴────────────────────┴─────────╯
```

See the <<_manual_import,manual import>> section for an explanation of the formatting we do before piping to the `doc insert` command.

`doc insert` can be used to insert multiple documents at once, see <<_importing_data,importing data>> for examples.

==== `doc remove`

Removes the document with the given key from the active collection.
For example say we have the following stored:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726821299020365824 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 32      │ │                     │       │         │
│   │         │ │ height │ 180     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

We would remove it as follows:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc remove Michael
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
```

If a document matching the key cannot be found, then an error is returned:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc remove Michael
╭───┬───────────┬─────────┬────────┬───────────────┬─────────╮
│ # │ processed │ success │ failed │   failures    │ cluster │
├───┼───────────┼─────────┼────────┼───────────────┼─────────┤
│ 0 │         1 │       0 │      1 │ Key not found │ remote  │
╰───┴───────────┴─────────┴────────┴───────────────┴─────────╯
```

You can also remove multiple documents at once with an input stream:

```
👤 Charlie 🏠 remote in ☁️ travel-sample._default._default
> [airline_10 airline_10748 airline_137] | wrap id | doc remove
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         3 │       3 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
```

==== `doc replace`

Replaces the document in Couchbase matching the key id of the new one, if there is no document matching the `id` then an error is returned.
Say we have the following document stored in the connected cluster:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726821687787126784 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 32      │ │                     │       │         │
│   │         │ │ height │ 180     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

And we have an updated version stored locally:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json
╭────────┬─────────╮
│ name   │ Michael │
│ age    │ 80      │
│ height │ 110     │
╰────────┴─────────╯
```

Then we can replace the first with the second using `doc replace`:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc replace
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726821910540648448 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 80      │ │                     │       │         │
│   │         │ │ height │ 110     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

See the <<_manual_import,manual import>> section for an explanation of the formatting we do before piping to the `doc replace` command.
If there was no document with the `id` Michael, then the replace would fail:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc replace
╭───┬───────────┬─────────┬────────┬───────────────┬─────────╮
│ # │ processed │ success │ failed │   failures    │ cluster │
├───┼───────────┼─────────┼────────┼───────────────┼─────────┤
│ 0 │         1 │       0 │      1 │ Key not found │ remote  │
╰───┴───────────┴─────────┴────────┴───────────────┴─────────╯
```

Similarly to `doc insert`, `doc replace` can be used to replace multiple documents at once, see <<_importing_data,importing data>> for examples.

==== `doc upsert`

This is the most robust way to import data into the cluster since it will work whether or not there is an existing doc in the cluster with a matching `id`.
If there is no document already in the cluster with a matching `id` then it behaves the same as <<_doc_insert,doc insert>>:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬─────────┬─────┬───────────────┬─────────╮
│ # │   id    │ content │ cas │     error     │ cluster │
├───┼─────────┼─────────┼─────┼───────────────┼─────────┤
│ 0 │ Michael │         │   0 │ Key not found │ remote  │
╰───┴─────────┴─────────┴─────┴───────────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json
╭────────┬─────────╮
│ name   │ Michael │
│ age    │ 32      │
│ height │ 180     │
╰────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc upsert
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726822249315041280 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 32      │ │                     │       │         │
│   │         │ │ height │ 180     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```

See the <<_manual_import,manual import>> section for an explanation of the formatting we do before piping to the `doc upsert` command.

Or if there is an existing document with the same `id` then `upsert` will behave the same as a `replace`:

```
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726822249315041280 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 32      │ │                     │       │         │
│   │         │ │ height │ 180     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json
╭────────┬─────────╮
│ name   │ Michael │
│ age    │ 80      │
│ height │ 110     │
╰────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> open user.json | wrap content | insert id $in.content.name | doc upsert
╭───┬───────────┬─────────┬────────┬──────────┬─────────╮
│ # │ processed │ success │ failed │ failures │ cluster │
├───┼───────────┼─────────┼────────┼──────────┼─────────┤
│ 0 │         1 │       1 │      0 │          │ remote  │
╰───┴───────────┴─────────┴────────┴──────────┴─────────╯
👤 Charlie 🏠 remote in ☁️ default._default._default
> doc get Michael
╭───┬─────────┬──────────────────────┬─────────────────────┬───────┬─────────╮
│ # │   id    │       content        │         cas         │ error │ cluster │
├───┼─────────┼──────────────────────┼─────────────────────┼───────┼─────────┤
│ 0 │ Michael │ ╭────────┬─────────╮ │ 1726822368839598080 │       │ remote  │
│   │         │ │ name   │ Michael │ │                     │       │         │
│   │         │ │ age    │ 80      │ │                     │       │         │
│   │         │ │ height │ 110     │ │                     │       │         │
│   │         │ ╰────────┴─────────╯ │                     │       │         │
╰───┴─────────┴──────────────────────┴─────────────────────┴───────┴─────────╯
```